In [1]:
import pandas as pd
import numpy as np

In [3]:
# create a series from dictonary
data={"A":85,"B":92,"C":78,"D":90,"E":88}

marks=pd.Series(data)
print(marks)

A    85
B    92
C    78
D    90
E    88
dtype: int64

In [11]:
#sort a series
data={"A":85,"D":90,"C":78,"B":92,"E":88}
marks=pd.Series(data)
print(marks)
print("--"*20)
#sort by index
print(marks.sort_index())
print("--"*20)
#sort by values
print(marks.sort_values()) # ascending order
print("--"*20)
print(marks.sort_values(ascending=False))#decending order

A    85
D    90
C    78
B    92
E    88
dtype: int64
----------------------------------------
A    85
B    92
C    78
D    90
E    88
dtype: int64
----------------------------------------
C    78
A    85
E    88
D    90
B    92
dtype: int64
----------------------------------------
B    92
D    90
E    88
A    85
C    78
dtype: int64

In [12]:
#reordering the index in series
data={"A":85,"D":90,"C":78,"B":92,"E":88}
marks=pd.Series(data)
print(marks)
print("--"*20)

marks=pd.Series(data,index=["A","B","C","D","E"])
print(marks)

A    85
D    90
C    78
B    92
E    88
dtype: int64
----------------------------------------
A    85
B    92
C    78
D    90
E    88
dtype: int64

# DataFrame

In [16]:
import pandas as pd
import numpy as np

In [18]:
data={
    'name':["A","B","C","D"],
    'age':[20,21,19,22],
    'marks':[85,92,78,90]
}
df=pd.DataFrame(data)
df

  name  age  marks
0    A   20     85
1    B   21     92
2    C   19     78
3    D   22     90

In [19]:
print(df.index)
print(df.columns)
print(df.shape)

RangeIndex(start=0, stop=4, step=1)
Index(['name', 'age', 'marks'], dtype='object')
(4, 3)

In [21]:
data=[
    ["A",20,85],
    ["B",21,92],
    ["C",19,78],
    ["D",22,90]
]
df=pd.DataFrame(data,columns=["name","age","marks"])
df

  name  age  marks
0    A   20     85
1    B   21     92
2    C   19     78
3    D   22     90

In [24]:
# create a dataframe dictonary of series
data={
    'maths':pd.Series([85,92,78],index=['A','B','C']),
    'Science':pd.Series([88,91,75],index=['A','B','C'])
}
df=pd.DataFrame(data)
df

   maths  Science
A     85       88
B     92       91
C     78       75

In [28]:
data={
    'name':["A","B","C","D"],
    'age':[20,21,19,22],
    'marks':[85,92,78,90]
}
marks=pd.DataFrame(data,index=["s1","s2","s3","s4"])
marks

   name  age  marks
s1    A   20     85
s2    B   21     92
s3    C   19     78
s4    D   22     90

## Loc and Iloc

In [34]:
marks=pd.Series(["A","B","C","D"],index=[101,102,103,104])
print(marks)
print("--"*20)
print('loc values') # manually generate index values
print(marks.loc[101])
print(marks.loc[102])
print(marks.loc[103])
print(marks.loc[104])
#print(marks.loc[1])#---->it shows error
print("--"*20)
print('iloc values') # original index values
print(marks.iloc[0])
print(marks.iloc[1])
print(marks.iloc[2])
print(marks.iloc[3])
print("--"*20)
print(marks.loc[102:104])
print("--"*20)
print(marks.iloc[1:4])

101    A
102    B
103    C
104    D
dtype: object
----------------------------------------
loc values
A
B
C
D
----------------------------------------
iloc values
A
B
C
D
----------------------------------------
102    B
103    C
104    D
dtype: object
----------------------------------------
102    B
103    C
104    D
dtype: object

In [59]:
## loc iloc on dataframe
data={
    'name':["A","B","C","D","E"],
    'age':[23,25,22,24,26],
    'dept':["HR","IT","FINANCE","IT","HR"],
    'Salry':[30000,35000,28000,40000,45000]
}
df=pd.DataFrame(data,index=["E1","E2","E3","E4","E5"])
df
print(df.loc["E1"])
print("--"*20)
print(df.loc["E2"])
print("--"*20)
print(df.loc["E3"])
print("--"*20)
print(df.loc["E4"])
print("--"*20)
print(df.loc[["E1","E3"]])
print("--"*20)
print(df.loc["E2":"E4"])
print("--"*20)
print(df.loc[["E2","E4"],["name","Salry"]])
print("--"*20)
print(df.loc[df['Salry']>35000])
print("--"*20)

#iloc
print("iloc examples:")
print(df.iloc[0])
print("--"*20)
print(df.iloc[1])
print("--"*20)
print(df.iloc[[0,3]])
print("--"*20)
print(df.iloc[0:4])
print("--"*20)
print(df.iloc[[0,2],[0,3]])
print("--"*20)
high_salary=df['Salry']>35000  #----->0,2-->e1,e2 rows \\ 0,3--->name ,salary(colum)
print(df.iloc[high_salary.values])

name         A
age         23
dept        HR
Salry    30000
Name: E1, dtype: object
----------------------------------------
name         B
age         25
dept        IT
Salry    35000
Name: E2, dtype: object
----------------------------------------
name           C
age           22
dept     FINANCE
Salry      28000
Name: E3, dtype: object
----------------------------------------
name         D
age         24
dept        IT
Salry    40000
Name: E4, dtype: object
----------------------------------------
   name  age     dept  Salry
E1    A   23       HR  30000
E3    C   22  FINANCE  28000
----------------------------------------
   name  age     dept  Salry
E2    B   25       IT  35000
E3    C   22  FINANCE  28000
E4    D   24       IT  40000
----------------------------------------
   name  Salry
E2    B  35000
E4    D  40000
----------------------------------------
   name  age dept  Salry
E4    D   24   IT  40000
E5    E   26   HR  45000
----------------------------------------
iloc examples:
name         A
age         23
dept        HR
Salry    30000
Name: E1, dtype: object
----------------------------------------
name         B
age         25
dept        IT
Salry    35000
Name: E2, dtype: object
----------------------------------------
   name  age dept  Salry
E1    A   23   HR  30000
E4    D   24   IT  40000
----------------------------------------
   name  age     dept  Salry
E1    A   23       HR  30000
E2    B   25       IT  35000
E3    C   22  FINANCE  28000
E4    D   24       IT  40000
----------------------------------------
   name  Salry
E1    A  30000
E3    C  28000
----------------------------------------
   name  age dept  Salry
E4    D   24   IT  40000
E5    E   26   HR  45000

## DataFrame operations:column& row manipulation

In [3]:
import pandas as pd
import numpy as np

In [5]:
data_a={
    'name':["A","B","C","D","E"],
    'age':[23,25,22,24,26],
    'marks':[85,92,78,90,88],
    'city':["delhi","mumbai","chennai","bengalor","hyderabad"]
}
df=pd.DataFrame(data_a)
df

  name  age  marks       city
0    A   23     85      delhi
1    B   25     92     mumbai
2    C   22     78    chennai
3    D   24     90   bengalor
4    E   26     88  hyderabad

In [7]:
# column selection
print(df['name'])
print("--"*20)
print(df[['name','age']])

0    A
1    B
2    C
3    D
4    E
Name: name, dtype: object
----------------------------------------
  name  age
0    A   23
1    B   25
2    C   22
3    D   24
4    E   26

In [8]:
# add new column
df["grade"]=["B","A","C","A+","B+"]
df

  name  age  marks       city grade
0    A   23     85      delhi     B
1    B   25     92     mumbai     A
2    C   22     78    chennai     C
3    D   24     90   bengalor    A+
4    E   26     88  hyderabad    B+

In [9]:
# sorting
print(df.sort_values(by="age")) #ascending
print("--"*20)
print(df.sort_values(by="age",ascending=False)) #decending

  name  age  marks       city grade
2    C   22     78    chennai     C
0    A   23     85      delhi     B
3    D   24     90   bengalor    A+
1    B   25     92     mumbai     A
4    E   26     88  hyderabad    B+
----------------------------------------
  name  age  marks       city grade
4    E   26     88  hyderabad    B+
1    B   25     92     mumbai     A
3    D   24     90   bengalor    A+
0    A   23     85      delhi     B
2    C   22     78    chennai     C

In [10]:
# column deletion
df=df.drop('age',axis=1)
df

  name  marks       city grade
0    A     85      delhi     B
1    B     92     mumbai     A
2    C     78    chennai     C
3    D     90   bengalor    A+
4    E     88  hyderabad    B+

In [11]:
#row selection 
print(df.iloc[2])
print("---"*10)
print(df.iloc[2])

name           C
marks         78
city     chennai
grade          C
Name: 2, dtype: object
------------------------------
name           C
marks         78
city     chennai
grade          C
Name: 2, dtype: object

In [12]:
# add new row
new_row={
    "name":'F',"age":23,"marks":92,"grade":"A"
}
df.loc[5]=new_row
print(df)

  name  marks       city grade
0    A     85      delhi     B
1    B     92     mumbai     A
2    C     78    chennai     C
3    D     90   bengalor    A+
4    E     88  hyderabad    B+
5    F     92        NaN     A

In [13]:
# row deletion
df=df.drop(5,axis=0)
print(df)

  name  marks       city grade
0    A     85      delhi     B
1    B     92     mumbai     A
2    C     78    chennai     C
3    D     90   bengalor    A+
4    E     88  hyderabad    B+

In [17]:
#give  all statitical values numerical values
print(df.describe())
print("--"*20)
print(df.describe(include='all')) #give all statitical values for all coumns

           marks
count   5.000000
mean   86.600000
std     5.458938
min    78.000000
25%    85.000000
50%    88.000000
75%    90.000000
max    92.000000
----------------------------------------
       name      marks   city grade
count     5   5.000000      5     5
unique    5        NaN      5     5
top       A        NaN  delhi     B
freq      1        NaN      1     1
mean    NaN  86.600000    NaN   NaN
std     NaN   5.458938    NaN   NaN
min     NaN  78.000000    NaN   NaN
25%     NaN  85.000000    NaN   NaN
50%     NaN  88.000000    NaN   NaN
75%     NaN  90.000000    NaN   NaN
max     NaN  92.000000    NaN   NaN

## groupby()

In [18]:
data={
    'name':["A","B","C","D","E"],
    'age':[25,25,24,24,25],
    'marks':[85,92,78,90,88],
    'city':["delhi","mumbai","chennai","bengalor","hyderabad"]
}
df=pd.DataFrame(data)
df

  name  age  marks       city
0    A   25     85      delhi
1    B   25     92     mumbai
2    C   24     78    chennai
3    D   24     90   bengalor
4    E   25     88  hyderabad

In [19]:
df.groupby("age")["marks"].mean()

age
24    84.000000
25    88.333333
Name: marks, dtype: float64